IDENTIFICATION DIVISION.
PROGRAM-ID. ROMANNUMERALS.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT STANDARD-INPUT ASSIGN TO KEYBOARD.
    SELECT STANDARD-OUTPUT ASSIGN TO DISPLAY.
    SELECT IN-FILE ASSIGN TO DYNAMIC IN-NAME 
        ORGANIZATION IS LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.
FD IN-FILE.
    01 IN-RECORD.
        05 NUMERALS PICTURE X(30).
FD STANDARD-INPUT.
    01 STDIN-RECORD   PICTURE X(80).
FD STANDARD-OUTPUT.
    01 STDOUT-RECORD  PICTURE X(80).

WORKING-STORAGE SECTION.
77  N    PICTURE S99 USAGE IS COMPUTATIONAL.
77  INCHOICE PICTURE S99 USAGE IS COMPUTATIONAL VALUE 0.
77  TEMP PICTURE S9(8) USAGE IS COMPUTATIONAL.
77  RET  PICTURE S9 USAGE IS COMPUTATIONAL-3.
77  CNT PICTURE S99 USAGE IS COMPUTATIONAL VALUE 0.
77  ND PICTURE S99 USAGE IS COMPUTATIONAL VALUE 0.
77  WS-FS PICTURE 9(02).
01  WS-EOF-SW PICTURE X(01) VALUE 'N'.
    88 EOF-SW   VALUE 'Y'.
    88 NOT-EOF-SW VALUE 'N'.
01  ARRAY-AREA.
    02 R PICTURE X(1) OCCURS 30 TIMES.
01  TEMP-AREA.
    02 TEMPCHAR PICTURE X(1).
01  ATTEMPT-AREA.
    02 RN PICTURE X(30).
01  INPUT-AREA.
    02 IN-R   PICTURE X(100).
    02 FILLER PICTURE X(79).
01  INPUT-CHOICE.
    02 FILLER PICTURE X(53) VALUE 'WOULD YOU LIKE TO INPUT FROM A (F)ILE OR (K)EYBOARD?'.
01  INPUT-DEFAULT.
    02 FILLER PICTURE X(49) VALUE 'ENTER THE FILENAME FOR INPUT OR TYPE END TO EXIT:'.
01  TITLE-LINE.
    02 FILLER PICTURE X(11) VALUE SPACES.
    02 FILLER PICTURE X(24) VALUE 'ROMAN NUMBER EQUIVALENTS'.
01  EXIT-LINE.
    02 FILLER PICTURE X(36) VALUE 'TYPE END TO EXIT'.
01  UNDERLINE-1.
    02 FILLER PICTURE X(45) VALUE 
       ' --------------------------------------------'.
01  COL-HEADS.
    02 FILLER PICTURE X(9) VALUE SPACES.
    02 FILLER PICTURE X(12) VALUE 'ROMAN NUMBER'.
    02 FILLER PICTURE X(13) VALUE SPACES.
    02 FILLER PICTURE X(11) VALUE 'DEC. EQUIV.'.
01  UNDERLINE-2.
    02 FILLER PICTURE X(45) VALUE
       ' ------------------------------   -----------'.
01  ENTER-TEXT.
    02 FILLER PICTURE X(20) VALUE 'Enter Roman Numeral:'.
01  PRINT-LINE.
    02 FILLER PICTURE X VALUE SPACE.
    02 OUT-R  PICTURE X(30).
    02 FILLER PICTURE X(3) VALUE SPACES.
    02 OUT-EQ PICTURE Z(9).
01  FILE-NAMES.
    02 IN-NAME PICTURE X(100).

PROCEDURE DIVISION.
    OPEN INPUT STANDARD-INPUT, OUTPUT STANDARD-OUTPUT.
   
    WRITE STDOUT-RECORD FROM INPUT-CHOICE AFTER ADVANCING 0 LINES.
    READ STANDARD-INPUT INTO INPUT-AREA.
    IF IN-R IS EQUAL TO 'f' OR 'F' 
        MOVE 0 TO INCHOICE
    ELSE
        MOVE 1 TO INCHOICE 
    END-IF.
    
    WRITE STDOUT-RECORD FROM EXIT-LINE AFTER ADVANCING 1 LINE.
    WRITE STDOUT-RECORD FROM TITLE-LINE AFTER ADVANCING 3 LINE.
    WRITE STDOUT-RECORD FROM UNDERLINE-1 AFTER ADVANCING 1 LINE.
    IF INCHOICE EQUALS 1 
        PERFORM KEYLOOP UNTIL ND EQUALS 1
    ELSE
        PERFORM FILELOOP UNTIL ND EQUALS 1
    END-IF.
    STOP RUN.

*>Main program for keyboard input
KEYLOOP.
    MOVE 1 TO N. MOVE SPACES TO ATTEMPT-AREA. MOVE 1 TO CNT.
    WRITE STDOUT-RECORD FROM ENTER-TEXT AFTER ADVANCING 1 LINE.
    READ STANDARD-INPUT INTO INPUT-AREA
    MOVE IN-R TO RN.
    IF RN EQUALS "END" THEN
        MOVE 1 TO ND
        CONTINUE
    ELSE
        WRITE STDOUT-RECORD FROM COL-HEADS AFTER ADVANCING 1 LINE
        WRITE STDOUT-RECORD FROM UNDERLINE-2 AFTER ADVANCING 1 LINE
        PERFORM CLEARLOOP VARYING CNT FROM 1 BY 1 
            UNTIL CNT IS GREATER THAN 30 
        PERFORM LOOP VARYING CNT FROM 1 BY 1
            UNTIL CNT IS GREATER THAN 30
        CALL "conv" USING ARRAY-AREA, N, RET, TEMP
        MOVE TEMP TO OUT-EQ 
        MOVE ARRAY-AREA TO OUT-R
        WRITE STDOUT-RECORD FROM PRINT-LINE AFTER ADVANCING 1 LINE
        
    END-IF.
END-LOOP.

*>Loop to ask for new files
FILELOOP.
    WRITE STDOUT-RECORD FROM INPUT-DEFAULT AFTER ADVANCING 1 LINE.
    READ STANDARD-INPUT INTO IN-NAME.
    IF IN-NAME EQUALS "END" THEN
        MOVE 1 TO ND
    END-IF.
    IF ND EQUALS 0 THEN
        OPEN INPUT IN-FILE
            PERFORM FILEINLOOP UNTIL ND EQUALS 1
        CLOSE IN-FILE
        MOVE 0 TO ND
    END-IF.
END-LOOP.

*>Main loop for file input
FILEINLOOP.
    READ IN-FILE
        AT END
            MOVE 1 TO ND
        NOT AT END
            PERFORM CLEARLOOP VARYING CNT FROM 1 BY 1 
                UNTIL CNT IS GREATER THAN 30 
            MOVE NUMERALS TO IN-R
            PERFORM LOOP VARYING CNT FROM 1 BY 1
                UNTIL CNT IS GREATER THAN 30
            CALL "conv" USING ARRAY-AREA, N, RET, TEMP
            MOVE TEMP TO OUT-EQ 
            MOVE ARRAY-AREA TO OUT-R
            WRITE STDOUT-RECORD FROM PRINT-LINE AFTER ADVANCING 1 LINE
    END-READ.
END-LOOP.

*>Same as original Loop
LOOP.
    MOVE IN-R(CNT:) TO TEMPCHAR.
    IF TEMPCHAR EQUALS SPACE THEN
        MOVE CNT TO N
        SUBTRACT 1 FROM N
        MOVE 31 TO CNT
    ELSE
        MOVE TEMPCHAR TO R(CNT)
    END-IF.
END-LOOP.

*>Empties array
CLEARLOOP.
    MOVE ' ' TO R(CNT).
END-LOOP.



